Revit 2026 API

# SlabShapeVertexArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SlabShapeVertexArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
SlabShapeVertexArrayIterator()
```
```fsharp
new : unit -> SlabShapeVertexArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

SlabShapeVertexArrayIterator Class

Autodesk.Revit.DB Namespace